{
    "list": [
        {
            "patent_abstract": "In one example embodiment, a wagering game system includes at least one wagering game computer program operative on the wagering game platform to detect a wager. A persistent state manager software component is operative to read or write persistent state data to and from the wagering game computer program and persistent state media. In one embodiment, the persistent state media is a bar-coded ticket, and in another embodiment an electronic data storage device such as a RFID device. A messaging system allows persistent state media devices to interact with the wagering game.",
            "patent_date": "2013-01-01",
            "patent_number": "8342944",
            "patent_title": "Persistent state systems, methods and software",
            "app_date": "2007-02-09"
        },
        {
            "patent_abstract": "This document discusses, among other things, systems and methods for alternative persistent state recovery methods. A method comprises detecting persistent state recovery information from one of two or more persistent state recovery techniques, wherein the persistent state recovery information identifies a persistent state in a wagering game; and restoring the persistent state of the wagering game from the detected persistent state recovery information.",
            "patent_date": "2012-07-10",
            "patent_number": "8216058",
            "patent_title": "Providing alternative persistent state recovery techniques",
            "app_date": "2007-02-16"
        },
        {
            "patent_abstract": "This description describes wagering game systems that include docking stations. In one embodiment, the apparatus includes a presentation unit configured to present a wagering game and a docking controller configured to detect when the apparatus is docked with a docking station and to detect when the apparatus is undocked from the docking station. The apparatus can also include a docking port, the docking port including at least one of a dock power unit configured to receive power via the docking station and a dock communication unit configured to receive wagering game content associated with the wagering game, the dock communication unit configured to receive the wagering game content when the apparatus is docked with the docking station. The apparatus can also include a wireless communication unit configured to receive the wagering game content when the docking controller when the apparatus is undocked from the docking station.",
            "patent_date": "2011-11-15",
            "patent_number": "8057303",
            "patent_title": "Wagering game system with docking stations",
            "app_date": "2007-06-08"
        },
        {
            "patent_abstract": "There is provided a peripheral update device. The peripheral update device includes at least one interface adapted to communicatively connect to at least one peripheral device of a wagering game machine and to an update device, the at least one interface adapted to receive a firmware update from the update device for a peripheral device of the at least one peripheral device. The peripheral update device further includes a processor being communicatively connected to the at least one interface and adapted to receive the transmitted firmware update via the at least one interface and further adapted to apply the received firmware update to the peripheral device via the at least one interface.",
            "patent_date": "2013-04-02",
            "patent_number": "8409009",
            "patent_title": "Peripheral update peripheral in a wagering game system",
            "app_date": "2007-06-13"
        },
        {
            "patent_abstract": "Systems and methods manage memory in a wagering game machine. The systems and methods determine one or more quantities of various types of memory that are required by a wagering game application. The systems and methods determine if the wagering game machine has enough available memory to perform a requested operation such as downloading the wagering game, activating a component of the wagering game, or installing content for the wagering game.",
            "patent_date": "2012-06-19",
            "patent_number": "8202168",
            "patent_title": "Systems and methods for managing memory in wagering game machines",
            "app_date": "2007-06-28"
        },
        {
            "patent_abstract": "Systems and methods for analyzing wireless signals in a wagering game environment are described herein. In some embodiment, a wagering game machine includes a wagering game unit configured to present wagering games. The wagering game machine can also include a network interface configured to exchange, with other devices on a wagering game network, information about the wagering games. The wagering game machine can also include a wireless signal detection device configured to detect wireless signals in a wagering game environment and to create wireless signal data for use in determining whether the wireless signals interfere with wireless communications of the wagering game network.",
            "patent_date": "2016-09-27",
            "patent_number": "9454870",
            "patent_title": "Analyzing wireless signals in wagering game environments",
            "app_date": "2008-01-11"
        },
        {
            "patent_abstract": "A computerized wagering game system includes a gaming module comprising gaming code which is operable to present a wagering game on which monetary value can be wagered, and a virtual input device. The virtual input device is operable to receive input from a user by detecting a position of a user input object such as a finger.",
            "patent_date": "2012-08-21",
            "patent_number": "8246456",
            "patent_title": "Wagering game machine with virtual input device",
            "app_date": "2008-06-19"
        },
        {
            "patent_abstract": "In some embodiments, a wagering game server includes an options visualization controller configured to receive search criteria and filter information for searching wagering titles, wherein the search is based on the search criteria and filter information. The server may include a game content unit configured to store the wagering game titles. The wagering game system can also include a wagering game machine configured to present the one or more wagering games in a visual map, the visual map comprising nodes that contain summary information associated with the wagering game titles, wherein the nodes are arranged in node groups, and wherein the node groups are graphically connected by graphical connectors. The wagering game machine can present a movable filter object configured to visually depict a filter criteria, wherein the movable filter object is movable onto one or more of the nodes to provide the filtering information to the wagering game server.",
            "patent_date": "2013-11-05",
            "patent_number": "8574072",
            "patent_title": "Visually presenting wagering game options",
            "app_date": "2009-01-30"
        },
        {
            "patent_abstract": "A gaming system for conducting a multi-player wagering game includes a multi-touch table surface that is touched by a handheld electronic wager input device (EWID) carried by a player for placing wagers on a wagering game displayed on the multi-touch table surface. Each EWID carried by a player has an associated unique identification code, linked to the respective player's account. Players indicate an amount to be wagered by touching the EWID to designated wager amount areas, then place the wager by touching the EWID to a designated wagering area. Because each EWID is uniquely associable with distinct player accounts, the gaming system can support any number of players placing wagers. The funds remain safe in the player account and no funds are stored on the EWID. Only the identification code is detected, which is compared with the associated player account before allowing that player to place wagers.",
            "patent_date": "2012-12-18",
            "patent_number": "8333655",
            "patent_title": "Methods of receiving electronic wagers in a wagering game via a handheld electronic wager input device",
            "app_date": "2009-07-10"
        },
        {
            "patent_abstract": "A wagering game system and its operations are described herein. In some embodiments, the operations can include presenting a wagering game on a display device of a wagering game machine. The operations can also include detecting head movements and facial gestures of a player of the wagering game via a video capture device of the wagering game machine, and generating player input data based on the head movements and facial gestures of the player. The operations can further include modifying wagering game content based on the player input data associated with the head movements and facial gestures of the player, and presenting results of the wagering game on the display device of the wagering game machine.",
            "patent_date": "2013-10-15",
            "patent_number": "8556714",
            "patent_title": "Player head tracking for wagering game control",
            "app_date": "2010-05-12"
        },
        {
            "patent_abstract": "A wagering game system and its operations are described herein. In embodiments, the operations can determine a wagering game in progress for a wagering game session, and determine an electronic playing card that is in use for the wagering game that uses playing cards. The operations can also determine primary content related to the wagering game, and electronically present the primary content on the electronic playing card for use in the wagering game. The primary content can include playing elements (e.g., card ranks and card suits) for the wagering game. The operations can also determine secondary content to be presented on the electronic playing card, and electronically present the secondary content on the electronic playing card during the wagering game session. The secondary content can include wagering games that are different from the primary content (e.g., secondary wagering games that use playing elements other than cards, such as slot games).",
            "patent_date": "2013-08-20",
            "patent_number": "8512137",
            "patent_title": "Controlling electronic playing cards in wagering environments",
            "app_date": "2010-08-20"
        },
        {
            "patent_abstract": "Electronic paper (e-paper) can be incorporated onto player tracking cards (101) to allow logos, themes, and/or other content (e.g., text, images, etc.) displayed on player tracking cards to be updated. An identifier is determined based on data read from a magnetic strip on a rewritable display card (503). The rewriteable display card comprises electronic paper (103). Account information associated with the identifier is received (505). Content to be displayed on the electronic paper is determined based, at least in part, on the account information (507). The content is written to the electronic paper (513).",
            "patent_date": "2013-07-09",
            "patent_number": "8480488",
            "patent_title": "Dynamic player tracking card",
            "app_date": "2010-10-07"
        },
        {
            "patent_abstract": "Gaming-related displays present text and graphics viewable with a special visual aid, e.g., a camera phone. The visual aid provides an interface allowing the player to interact with, and be engaged by, the gaming machine and the gaming environment. The text and graphics shown on the visual aid may provide information that adds to the player's experience. For example, a gaming system includes a gaming terminal for a wagering game. The gaming terminal includes a light-emitting area emitting a predetermined pattern of invisible light having wavelengths outside the visible electromagnetic spectrum. The gaming system also includes a visual aid including a sensor and a visual aid display. The visual aid detects, with the sensor, the pattern of invisible light, converts the pattern of invisible light into a pattern of visible light having wavelengths inside the visible electromagnetic spectrum, and displays the pattern of visible light on the visual aid display.",
            "patent_date": "2016-02-23",
            "patent_number": "9269217",
            "patent_title": "Infrared displays for human interfaces viewable by camera",
            "app_date": "2013-03-11"
        }
    ],
    "search_url": "http://www.patentsview.org/api/patents/query?q={\"_and\":[{\"inventor_last_name\":\"motyl\"},{\"_or\":[{\"assignee_organization\":\"WMS Gaming Inc.\"},{\"assignee_organization\":\"Bally Gaming, Inc.\"}]}]}&f=[\"app_date\",\"patent_title\",\"patent_number\",\"patent_date\",\"patent_abstract\"]&s=[{\"app_date\":\"asc\"},{\"patent_number\":\"asc\"}]",
    "last_search": "4/8/2017"
}

